{"texts": ["Learning objectives 1.1 General 1.3 characteristics Interdependence of plants 15 Unusual plants of plants and animals 1.7 Uses of plants\n1,.2 Preparation 1,.4 and Adaptations storage of food 1.6 in plants in plants Fungi\nPlants can be seen everywhere, 1.1 i.e , GENERAL in neighbourhood, CHARACTERISTICS in Plants have roots school, that OF on the fix PLANTS river them side, minerals from on the soil, in the soil, mountains, etc. The stem grows They above mostly lie below the plant: the ground and the ground and absorb helps to carry water and Branches bear leaves, water, flowers minerals Leaves help the and plant to fruits and food to all the parts of sunlight and chlorophyi prepare food with the help Most plants bear of water; flowers that carbon change dioxide into in the not bear flowers are called fruits_ presence of non-flowering They are plants. called Fruits have seeds inside them. flowering Some fruits plants. Plants which are do Seeds give rise to new plants. fleshy and sweet. Plants cannot move from one Plants breathe through place to another on their own but  stomata which are show leaves: tiny pores tmovements of their body ! present mostly o the parts. lower New plants either grow from seeds surface of the or from other parts of the plants.", " surface of the or from other parts of the plants. 1.2 PREPARATION AND STORAGE OF FOOD IN PLANTS A plant prepares food not only for itself but for heir leaves to make food. Since, leaf the whole of the living is the place where food is world, Most plants depend on lactory of the plant: prepared, it is called the kitchen or food 'arts of a Leaf he flat part of a leaf is called the leaf blade Running lled midrib.", "leaf is called the leaf blade Running lled midrib. There are number of through the middle of the leaf is the main vein side veins coming out of the main vein: Leaf blade Stalk\nMain vein Side vein Parts of leaf\nLeaf apex\n| Science\nPlants\ninside them: Some help to carry Stoma side veins have tiny tubes The main vein and prepared by of the leaf and others carry food and minerals to all parts water parts of the plant: the leaf to other The leaf is attached to the stem by of the leaf is called the leaf apex The tip small pores, called Mostly the underside of the leaf has many means Of a stalk in exchange of gases during stoma) which help the plant stomata (singular pores with the naked We cannot see these eye: photosynthesis Reverse side and of a breathing leaf showing stomata Photosynthesis food using carbon dioxide and water in the plants make their own presence The process by which green 'Photo' means 'light' and 'synthesis means 'to put together' photosynthesis of sunlight is known as the soil in the presence of sunlight which is dioxide from air and water from trapped Leaves use carbon in the leaves to make food by the green pigment chlorophyll present carried by the stem to the leaves. and minerals are absorbed by the roots and Water Carbon dioxide is taken in by the leaves through stomata trapped by the chlorophyll when it falls on the leaves.", "ed by the chlorophyll when it falls on the leaves. Sunlight is which is a kind of sugar: Oxygen is released during in the form of glucose this The food is prepared essential for the survival of all living beings. process which is Sunlight Water Glucose + Carbon dioxide + Oxygen Chorophyll formed is taken to all parts of the plant by the stem: The plant uses this food for The glucose so getting energy producing more branches and leaves; making flowers, fruits and seeds, repairing damaged parts is stored in the form of starch in different parts of the plant like root, leaf, stem, etc; Extra glucose Animals including humans eat these plant parts.", "se Animals including humans eat these plant parts. Table Different parts of the plants used as food Fruit Flower Seed Stem Root Leaf Part of plant Apple, Broccoli; Coffee, Sugarcane, Beetroot; Dahlia, Spinach, Examples Mango, Cauliflower Pulses; Potato, Carrot; Sweet Coriander; Papaya Cereals Onion potato, Radish Fenugreek To test the presence of starch in leaves Starch is colourless, but it turns blue-black in presence of iodine To test for the presence of starch; a leaf is bleached by frst boiling it in Water and then in akcohol The bleached leaf is washed in cold water and a few drops of iodine are added over it: If the leaf turns blue black, it confirms the presence of starch in the leaf  To test the need of sunlight for photosynthesis Shoot of a plant shows movement towards light; To test the need of sunlight for photosynthesis, a plant or two s0 that it does while roots grow away from light.", " s0 that it does while roots grow away from light. is kept in a dark room for a day 2 \nP d\nnot make food for some time Then; its leaf is covered partly with black paper and the plant is kept in sunlight for & few hours Then the leaf which Was partly covered is plucked; black paper is removed from the leaf and the leaf is bleached: The bleached leaf when tested with iodine solution will show blue black colour except for the covered part This is because the part which was covered with black paper could not trap sunlight and could not produce starch: To test the need of chlorophyll for photosynthesis To test the need of chlorophyll for photosynthesis; We take a colourful leaf such as a coleus leaf which is green and yellow in colour: It is bleached and washed in cold water: Then, & few drops of iodine are added to it: Only the green portion (which contains chlorophyll) of the leaf turns blue-black 1.3 INTERDEPENDENCE OF PLANTS AND ANIMALS Energy is something which we need for doing any activity: This energy comes from food that is prepared by the green plants  Sunlight is the main source of energy on Earth Green plants can trap this energy and convert it into food: Plants also give out oxygen during photosynthesis which is used by animals to breathe: Thus, animals depend on plants for food and oxygen: Animals breathe out carbon dioxide which is used by plants to make food Thus, plants and animals are interdependent on each other: \n1.4 ADAPTATIONS IN PLANTS Natural home of a plant is called its habitat  Each habitat has its own characteristics, i.e,, some places are warm; some are hot, some are cold and some are very cold.", "ome are hot, some are cold and some are very cold. Some places get a lot of rainfall while others are dry: Plants have special features to live successfully in their respective surroundings and have adjusted themselves to the different habitats o Earth e g, desert plants try to save whatever water is available and hence have adjusted well with low water conditions. This process of adjusting or changing to suit the environment is called adaptation.\nAdaptations in Terrestrial Plants Plants that grow on land are called terrestrial plants As there are different land forms like plains, hills, deserts, swamps, etc,, there are different types of plants growing in each of these habitats | Science 3\nPlants growing in the plains climate. It is neither too hot nor too cold: The Plains have a moderate The rainfall is just climate is warm to hot in summer and cold in winter: As the climate is well suited for plant growth, sufficient for plant growth: in the plains have lots of many kinds of plants grow here: Trees growing branches e & , neem; peepal, mango, banyan, etc: Most trees growing in plains usually shed their leaves in winter to themselves from the cold weather and get new leaves again protect maple, Banyan Such trees are called deciduous trees, e &, oak tree in spring: elm; apple etc.", "us trees, e &, oak tree in spring: elm; apple etc. shed their leaves and remain green throughout the year: Such trees Certain trees do not are called evergreen trees, e g, some varieties of neem plant: where it rains heavily, tall and thick trees (e &, teak, rubber; etc:) and some short In plains, home to trees lianas) grow: Such areas are called rainforests which are many and climbers (e.g , animals, Most rainforests are found in South America, Asid, Africa and Australia.\nMango tree\nPeepal tree\nSugarcane\nTeak\nPlants growing on hills The climate on hills and mountains is cold to very cold. During winter; there is snowfall in some areas. Therefore; the plants growing on hills are well adapted to such weather conditions.\nWoody cone\nNeedle like leaves Needle like leaves and cone of a pine tree\nPine tree\nof trees helps to slide off the snow easily: This helps to prevent damage to the plant Sloping shape and its parts due to extreme cold.", "t Sloping shape and its parts due to extreme cold. Leaves are needle shaped with waxy coating: This helps to prevent any damage from the snow These trees have woody cones instead of flowers That is why they are  called coniferous trees  The cones are very hard and bear seeds inside them e g, pine, spruce; cedar (such as deodar), fir; etc. Most of the conifers are evergreen trees eg, pine, spruce and some conifers are deciduous trees eg, larch Cedar Spruce\nPlants growing in deserts Climate in deserts is hot, = dry and dusty:  of water Inspite of all these There is shortage disadvantages, deserts with certain plants grow Desert Oak, found in Australia has roots that in special features. are 30 times longer than its trunk The roots go Certain plants, like Acacia or babool (also called kikar) have small = very deep into the ground to reach water;  This leaves to prevent water loss through water is then stored in the trunk: When there transpiration; Transpiration is the process of losing is no water in the desert, local people put thin water in the form of vapour through the leaves. stomata of pipes into the trunk of this tree; to drink water: Some plants, such as date palms, have and deserts.", "Some plants, such as date palms, have and deserts. strong dry and hard leaves which help them to survive in hot\nAcacia tree Date palm Cactus Certain plants, like mesquite tree, have roots that go down up to 20 metres under the ground in search of water  Certain plants, like cactus, have leaves modified into spines that help in preventing In some desert plants; the stomata are found deep into water loss through stomata. These spines the leaves rather than on the surface of the leaves discourage animals from eating them. The Hence; they are called sunken stomata.", "g them. The Hence; they are called sunken stomata. This reduces green stem stores water and carries out water loss through stomata: photosynthesis.\nPlants growing in swamps or marshes Marshes have clayey soil with plenty of water: The soil is sticky and does not have enough air for the roots of the plants to breathe To withstand these problems, the trees growing in marshy areas have roots growing out of the water-logged soil to breathe air alongside normal, underground roots: Such roots are called breathing roots or pneumatophores  Mangrove trees grow in marshes eg, sundari tree (a mangrove tree) found in Sundarbans\nPlants growing in sea coasts Mangrove tree The coastal areas have hot and wet climate; Trees growing in coastal areas should be able to withstand salty water; strong winds and heavy rainfall.\nCoconut tree\nPepper plant\nScience\n5\nstraight: They have a crown of giant, feather-like The trees growing here are usually tall znd to grow well in salty water; Their They are adepted COconoity; pepper: fruits Ieaves which allow the wind to pass through: examples are trees and seeds are scattered by water: Some Adaptations in Aquatic Plants lakes, seas, oceans) are called aquatic plants.", "ts lakes, seas, oceans) are called aquatic plants. Aquatic plants Plants growing in water (ponds; are fixed, floating and underwater plants Of three types- Fixed plants The roots of such plants are much reduced and are fixed to the mud at the bottom of the pond hollow; light and flexible so that they stay afloat and can bend easily The stems are long, with broken or uprooted. the waves of water and do not get Their leaves are broad and flat which help in staying afloat and to get enough air and sunlight for phototy atheoin the side of the leaves so that they can breathe easily Stomata are On upper The leaves of fixed plants have a waxy coating 0n their surface $o that water cannot stay on them This prevents them from rotting o shrivelling up. Some examples are water lily, lotus, etc: Lotus Floating plants These plants float freely in water as they have spongy bodies filled with air: They are not fxed at the bottom of the water body: Their roots just float below the water surface .", ": Their roots just float below the water surface . They are small and light in weight: Some examples are duckweed (Wolfia), water lettuce (Pistia) and water hyacinth\nDuckweed\nWater hyacinth\nUnderwater plants Some plants like Hydrilla and tape grass remain completely submerged in water: So, they are called underwater or submerged plants\nHydrilla\nTape grass\nThese plants have thin and narrow leaves with flexible stems to withstand water currents. Hydrilla has tiny leaves and the leaves of tape grass are ribbon-like Their roots are fixed to the bottom of the pond. The leaves of underwater plants have no stomata at all. They breathe the dissolved oxygen through their body surface.\n6\n1.5 UNUSUAL PLANTS Plants are primarily known for their green colour due to chlorophyll and their self-dependence for food. However; there are certain plants which show different types of nutrition: Insectivorous Plants There are some plants which eat insects  Such plants are  known as insectivorous plants  These plants are green and make their own food but they Some  plants like  dodder  do not have in colour grow in soil which is poor in mineral (nitrogen). So, they trap and eat chlorophyll so they do not make their own insects to fulfil their nutrient requirement: Some examples food, instead absorb food from other living are sundew, Venus fly trap and pitcher plant.", "ving are sundew, Venus fly trap and pitcher plant. plants Such plants are called parasites In pitcher plant, the leaf is modified into a pitcher with a lid which can open and close. The pitcher is filled with a special nectar (digestive liquid). Whenever an insect comes to feed on this nectar and sits on the edge of the pitcher the lid closes and the insect is trapped inside. The insect gets digested from which the plant can obtain its mineral nutrition:\nVenus flytrap\nPitcher plant\nThe leaves of Venus flytrap are like boxes with hinges They have long hair along the edges. When an insect touches the hair; the leaf closes rapidly, trapping the insect inside. The insect gets gradually digested, 1.6 FUNGI Fungi are organisms that cannot make their own food by photosynthesis as they do nothave chlorophyll. They absorb nutrients from dead and decaying plants, animals or stale food. They are also called saprophytes.\n| Science\n1\nMoulds and mushrooms are some examples of fungi:\nSometimes   bread slices change colour when keep them for longer time at room temperature, Vou is because of the growth of moulds on them This\nMushroom\n1.7 USES OF PLANTS produce food in the form of fruits, vegetables, pulses, producers.", "the form of fruits, vegetables, pulses, producers. They grains, Plants are spices , nuts, etc;, that are required by animals to survive: during the day by the process of 'photosynthesis which is used by Plants produce oxygen animals for breathing: Plants provide us with medicines, oil, rubber; wood, paper; etc: provide us with fibres used to makes clothes, such as cotton, jute and flax bags, Plants etc. Plants maintain the balance of oxygen and carbon dioxide gases in atmosphere Plants help to beautify our surroundings Bamboo plants are tall plants. They are used for making furnitures, mats, baskets, etc. Young bamboo shoots are Used to prepare food items, like curry pickles, etc: It has high nutritive value. Some grasses are used to make paper: Paper was first made in Egypt from a grass called papyrus Plant roots hold the soil tightly and protect it against erosion. Bamboo plant Dried grass is used as packing materials and for side cover of air coolers\n1. Insectivorous plants trap and eat insects because 4 absorb nutrients from dead plants (A) They do not have chlorophyll and animals. (B) They cannot make their own food (A) Dodder VC) The soilin which they= growlacks some nutrients (B) Fungi (D) They cannot trap sunlight. (C) Duckweed 2. Select the odd one out.", " sunlight. (C) Duckweed 2. Select the odd one out. (D) Hydrilla (A) Venus flytrap (B) Sundew 5. Select the incorrect statement (C) Pitcher plant (D) Mushroom (A) Flax and jute provide fibres 3 The picture shows a plant (B) Papyrus plant was first used to make paper: which gives us paper: Identify it (A) Mustard (C) Plants maintain balance of oxygen and carbon (B) Bamboo dioxide as they 'take in the former and release (C) Neem latter during photosynthesis. (D) Broccoli (D) None of these.\n8", "CHAPTER\n2\nAnimals\nLearning objectives 2.1 Classification and characteristics of animals 2.3 Reproduction in aimals\n2.2 Adaptations in aimals 2.4 Food chain, food web ad energy flow Like plants, animals are also found everywhere in the world. They: are found inhabiting difercnahabitey They are nulticelhlarCThey obtain energy by consuming plants or other anineabia of our planet: animals can move from one place to give birth to young ones or lay eggs. Unlike plants, most of the another: They also respond to the changes in the environment: 2.1 CLASSIFICATION AND CHARACTERISTICS OF ANIMALS on the presence or Animals are classified into two main groups invertebrates and vertebrates based absence of backbone. Animals\nInvertebrates\nVertebrates (With backbone)\n(Without backbone)\nE:g, Spiders, scorpions, snails, etc.\nBird\nMammal\nFish\nAmphibian\nReptile\nInvertebrates They do not have backbone. Their body is divisible into head, thorax and  abdomen. animals, insects are most numerous than any Some invertebrates are insects, worms, snail; Among Most insects have hard body other animal group: crab, spider; etc_ covering made up of a material called chitin: Insects have six jointed legs.", "rial called chitin: Insects have six jointed legs. They may or may not have wings.\nSnail\nCrab\nSpider\nCockroach\nAnt\nInvertebrates\nScience 15\nThey are further Vertebrates vertebrates: divided called into backbone arc Animals that have various . Fish Btor They live in watcr; breathe through gills; They with scales: Their body is covered and tail t0 swim; Shark They have fns They lay eggs. Fish etc,, are some fishes 3 guppy fish, mackerel, Shark; 6y Amphibians They can live both on land  They have moist skin and in that helps water . Young   one  of frog called when they are under water. them  tadpole  breathes   through When on land, to they breathe 4 gills: the moist skin,  through _ Frog They lay eggs. 6 0 Frog, toad, newt; etc , are some Reptiles amphibians , Most of the reptiles live on land. They have dry scaly skin. 0 They lay eggs. Most reptiles have four legs and a tail except snakes: Snake Crocodile Snakes; lizards, crocodiles, etc,, are Lizard some reptiles. Reptiles Birds They have a light body because they have light bones (hollow; air They filled). have two legs and their body is covered with feathers. They lay eggs.", "heir body is covered with feathers. They lay eggs. They have a pair of wings to fly: Crow; sparrow; eagle; pigeon, etc, are some flying birds: Ostrich; kiwi and penguin are some birds which cannot fly: They are called flightless birds.\nPigeon Sparrow Flying birds\nOstrich\nKiwi\nPenguin Flightless birds\n16 \nMammals They have hair on their bodies. They give birth to babies (except duck-billed Invertebrates fish,amphibians andreptilesare called platypus and spiny anteater as they Jay ' cold-blooded animals, as their body temperature eggs). Mothers suckle their changes with the change in the temperature of young ones. the surroundings: They breathe through lungs. Birds   and mammals   are   called warm-blooded They have four limbs. animals, as their   body temperature remains Horse, dog, ' cow, whale; dolphin, human; etc,, are constant despite the changes in the temperature some mammals. of their surroundings Bat is a mammal that can fly:\nHorse\nDog Anteater Mammals\nPlatypus\n(A)\n(B)\n(A)\n(B)\n(C)\n2 Which of the following options does NOT (C) describe the given animal?\n5.", "options does NOT (C) describe the given animal?\n5. Match the columns and select the correct option. (A) Nocturnal (active at night) animal Column I Column II (B) Flying mammal P Birds (i) Gills (C) Egg-laying animal Q. Reptiles (ii) Hollow bones D) Animal with hair on its body R Fish (iii) Have hair on body 3_ The young one of the amphibian shown in the S_ Mammal (iv) Dry scaly skin picture breathes through (A) Gills (A) P-(ii) , Q-(iv), R-(i) , S-(iii) (B) Moist skin (B) P-(i), Q-(iii) , R-(ii) , S-(iv) (C) Lungs (C) P-(ii) , Q-(iii) , R-(i), S-(iv) (D) Skin and lungs (D) P-(iv) , Q-(iii) , R-(ii) , S-(i)\nScience 17\n2.2 ADAPTATiONS In ANIMALS All animals need t0 protect (hemselves from  theharsh wcather conditionsand enemies: Dinosaurs were huge animals. that They also need to earn (heir food, For this, they lived on the Earth  many million need t0 adapt Or adjust themselves to different years ago.", "adapt Or adjust themselves to different years ago. They were the largest environmental conditions. animals on land at that time; They \" special features in got wiped out completely a5 The process of developing they = therselves to the changing could surroundings = nog order toadjustto thechanges in the environment which once existed and now 'Such = ~adar` is called adaptation. disappeared are called extinct animals; 'arimaak ` corglete \" Adaptations in animals\nAdaptations to habitat\nAdaptations to food habits\nMigration and hibernation\nAdaptations for protection\nAdaptations to Habitat The home or natural environment in which an animal lives is called habitat: Like also survive in different habitats. plants, animals € can Types of animals according to their habitats\nTerrestrial animals\nAquatic animals\nAmphibians\nArboreal animals\nAnimals living at poles\nAnimals living in deserts\nAnimals living in mountains\nAerial animals Animals ` living i in plains\nTerrestrial animals Terrestrial animals are the animals that live on land, They have legs  to walk to feel on land and changes around them; to find food and to escape from enemies Most of them sense breathe organs lungs. Terrestrial animals can be further grouped into animals living at poles, in  through and in plains.", "nimals living at poles, in  through and in plains. deserts, mountains Animals living at poles It is very cold and full of snow at the poles Therefore, very few animals can be seen there e g , polar bear; penguin, etc. Polar bear is found in the Arctic region. It has a thick hairy coat which traps body heat and keeps it warm. It has padded feet that helps it to walk easily on the snow. Penguin is a flightless bird but a Polar bear Penguin strong swimmer found in the Antarctic region. Animals living at poles They mostly sit close to each other to keep themselves warm: Both polar bear and fat under their skin, called blubber which penguin hav- stored keeps them warm Other animals found in the Antarctic region are seals, walruses, albatrosses, etc.\n18 \nAnlmals living In deserts Camel sweats very little and Hump passes very Ilttle urlne and dry \" dung Thls way it conserves water in its body: Camel Is called the ship of the desert The skin of camel is thick The thick skin protects it from the hot Sun: It has long legs and padded feet to walk on the hot sand, The Jong legs keep the body away from the hot sand. It can go without water and food for many days.", "d. It can go without water and food for many days. Camels have humps on their back which have stored fat inside them; Camel When there is shortage ' of food, camels use the stored fat inside the hump Olympiad_ Bite as source of energy: Deserts are very hot during the day' but become cold at night; Animals have adapted themselves in water is available; 0 many ways to live in hot When and dry conditions. drink   over 200 camel can During sand storms, camel $ litres of water at one time: nostrils close to block out sand: They have long eyelashes to prevent sand from entering their eyes. Many birds, active during snakes, lizards, spiders, insects, etc , also live in the desert: Desert animals are usually dawn or dusk; as it is very hot during the day: They sleep during the day time at cooler places: Animals living in mountains Animals living in mountains include mountain mules, sheep, etc: The furry hair of mounood goats, goats are very good goats are white in winter; making it hard to them against the snow. Mountain egothes areinsedhos toavelling in mountains regularly: at climbing and eating plants on high slopes.", "rly: at climbing and eating plants on high slopes. Animals like yak; found on Himalayan snow mountains also have long and thick fur:\nYak\nMountain goat\nMule\nAnimals living in mountains Animals living in plains Most of the animals are seen Animals living in plains have the advantage of moderate climate: elephant, etc , are in this habitat. Horse, dog, cat; cOW, etc , are domestic animals and lion, tiger; wild animals.\nCow\nCat\nTiger\nAnimals living in plains\nAquatic animals Animals that live in water are called aquatic animals. Most of the aquatic animals have a streamlined body to move easily in water: The body ofa fish is covered with scales that are water-proof: They - prevent Science 19\nThey have fins for breathing in water. Dala into their bodies gills But absorbed direction: They havc to the surface of aler ~dolph water from being changing They come up Uheir body: The tail fin helps 'breathe through lungh bteat \nCrab\nDolphin Whale Aquatic animals\nOctopus (A) Fish Turtle (C) R Amphibians Match the columns to live both on adapted option . 'Amphi' means both: Amphibians are etc.", "d option . 'Amphi' means both: Amphibians are etc. When frogs, toads, salamanders; Column [ land and in water e &  and use their legs to Webbed feet on land, they breathe through their lungs breathe through their moist skin Q. Blubber move. When in water; they and their strong hindlimbs Frog Salamander R Eight arms They have webbed feet for swimming Amphibians A tail which can (back legs) help in swimming and jumping (as in frog) (A) P-(iv), Q-(i), R (B) P-(ii) , Q-(iii) , Arboreal animals and chameleon have adapted themselves to ` live (C) P-(iv) , Q-(iii) Animals such as monkey, squirrel, orangutans on These animals have strong claws that help trees. P-(iv) , Q-(iii  animals are called arboreal animals. them Such to ~climb legs and arms and a tail for holding The animal up and down the tree branches. They also have strong on the tail in some animals like monkey and chameleon helps to grip the branch breathe in wate branches.", "helps to grip the branch breathe in wate branches. The\nAdaptations\nMonkey\nHerbiv (Plant\nSquirrel\nChameleon\nArboreal animals\nHors Sheep\nAerial animals\nAnimals like birds and bats spend lot of time flying in the air: Such animals are called aerial animals. Birds have light bodies as Herbi their bones are hollow: They have wings which help them to fly: Anin Their body is covered with feathers which keep them warm_ The plar tail feathers help \" have Sparrow them change the direction while Alying \" They Bat it streamlined bodies that Aerial animals help them to cut through the air easily: he Bat is a mammal with the ability to Aly: Its wings are not really wings, but skin stretched between its toes; like the cloth in an open umbrella.\n20 \nLiving_ at poles [Living in mountains] Living in plains\n(A) P (B) Q (C) R (D) $ X Z 2. Match the columns and select the correct (A) Camel Guppy Cow option. (B) Polar bear Sheep Seal Column [ Column II (C) Bat Sheep Tiger P Webbed feet (i) Octopus (D) Penguin Yak Cat Q Blubber (ii) Monkey R Eight arms (iii) 5. In which respectare the given animals similar? Penguin S.", "h respectare the given animals similar? Penguin S. A tail which can hold (iv) Frog (A) P-(iv), Q-(i), R-(iii) , S-(ii) (B) P-(ii) , Q-(iii) , R-(i) , S-(iv) (C) P-(iv), Q-(iii) , R-(i) , S-(ii) (D) P-(iv), Q-(iii) , R-(ii) , S-(i) (A) They all give birth to young ones.", "ii) , S-(i) (A) They all give birth to young ones. (B) They all can swim in water: 3 The animal shown in the given figure can (C) They all are warm-blooded animals breathe in water because it has (D) Both (A) and (C)\nAdaptations to Food Habits Animals according to their feeding habits\nHerbivores (Plant eaters)\nCarnivores (Flesh eaters)\nOmnivores (Plant and flesh eaters)\nScavengers (Eat flesh Parasites (Depend on of dead animals) their host for food)\nHorse, Cow, Sheep, Elephant]\nLion, Lizard, Snake, Tiger\nCrow, Bear; Man\nVulture, Hawk; Hyena\nHead louse\nHerbivores  Animals which eat plants are called herbivores As Small intestine is longer in herbivores than in carnivores plant food is rich in substance called cellulose, as digestion of cellulose takes longer time: Longer it needs to be chewed well.", "es longer time: Longer it needs to be chewed well. For this purpose, intestine ensures that food stays in the intestine for herbivores have sharp incisors to cut the food longer period of time and is properly digested: and strong molars to grind food e g,, cow, horse, giraffe, sheep, elk; etc: Animals like squirrels and rabbits have razor sharp front teeth to gnaw and bite on nuts, berries and wood. Insects like honey bee, butterfly, etc: are also herbivores. Science 21\nHorse\nCow\nSheep Herbivores\nButterfly\nBee\nCarnivores Animals that eat the flesh of other animals are called carnivores Most of them have sharp - canines (tearing teeth) for hunting and tearing the flesh of its prey e g, lion, tiger; wolf; and lizard , Atonos Flesh eating birds like eagles have sharp claws to catch their prey and sharp beaks to tear their F etc  flesh .\nLion\nLizard Carnivores\nEagle Omnivores Animals like dog, bear; human, hedgehog etc, eat both plants and flesh of other animals are called omnivores.", "s and flesh of other animals are called omnivores. Such They have sharp teeth like carnivores to tear flesh and flat teeth animals to like ` grind food: Crow is also an omnivore but it does not have teeth; it has a beak herbivores  instead.\nBear Omnivores\nCrow\nScavengers Some animals eat the flesh of dead animals as their food therefore they also help in keeping the environment clean eg, vulture; hawk; hyena, etc. They are called scavengers. Vulture Parasites Hyena Scavengers Animals that live on or inside the bodies of other called parasites. The animal animals and depend on them for food and shelter are that provides food and shelter to the parasite is cause harm to the host: Parasites that live known on the as host: Parasites body of human ectoparasites e g , fleas, lice, beings or other mosquitoes, bed animals are called are called bugs, endoparasites etc. and the parasites that live inside the hosts body when e.g, tapeworms, roundworms, hook worms, etc; we eat unhygienic food or eat with unclean Endoparasites enter our body sucking tubes in their mouths, hands.", "ter our body sucking tubes in their mouths, hands. Parasites do not have teeth, they mostly have 22 \nDog\nTapeworm\nLouse Parasites\nLeech\nMigration and hibernation Animals are found everywhere in almost all types of weather  conditions; Different animals show different types of adaptation The   Siberian  cranes come to India for survival in different environmental conditions. Animals that every year from Siberia to escape the live in very cold places find it difficult to survive due to shortage severe cold there of food. There are two ways of dealing - with cold Migration Hibernation\nMigration Many animals leave cold places in the winter where they' live and travel to warmer areas, where there is enough food. When winter ends, they travel back home. This long journey is called migration eg, whales, butterflies, birds like few cranes; Arctic tern, etc.\nArctic tern\nHibernation When an animal hibernates, it  does not leave its habitat, but Some   aimals   become   inactive during becomes inactive. It mostly falls summer ad undergo & long sleep This inactivity is called aestivation or summer Arctic ground squirrel into deep sleep  throughout Bees; lungfishes, snails, the winter: This is called hibernation or winter sleep. These sleep.", "s called hibernation or winter sleep. These sleep. Example earthworms; tortoise, etc animals eat well during summer when food is easily available: They live on this stored fat during hibernation. Some The extra food gets stored as fat in their body bear; Arctic ground squirrel, some snakes and animals hibernate in caves Or underground holes. Eg , lizards, etc:\nAdaptations for Protection Animals are often hunted and eaten by other animals. Hence, animals should be able to protect themselves from their enemies (predators) and more is the ability to protect Bear is so big that animals Deer can sense danger competitors The of are scared to come near it. and run away very fast: themselves, the more are their chances living: Most animals have sharp sense of hearing, sight and smell: If they sense danger they quickly run away e.g, mice; zebra, deer; etc; fly away eg, bird, insect; swim away e g , fish: Animals like elephant; beat; hippopotamus;, whale are huge: Their body size scares away most of their enemies. Mimicry is nothing but imitating other animals Eg;: Harmless flies often mimic dangerous insects like bees or wasps.", " often mimic dangerous insects like bees or wasps. The hawk moth caterpillar mimics snake_ Science 23\n\"blending with surroundings is called camouflage: Eg' The (rick of Chameleon can change its body colour according to its surroundings slick insect looks almost like a twig: grasshopper is difficult to be noticed if it is sitting on & green leaf: parrot also gets hidden in the leaves of the trees because of its green colour: The colour; shape = and markings of some animals make it difficult to be noticed in = their which blend with the jungle grass. White fur of a polar surroundin Tiger and zebra have stripes  bear - with the surrounding snow; making it difficult to be spotted. matcl\nHawk moth caterpillar\nStick insect\nChameleon\nTiger Some animals stay in groups to protect themselves from enemies e g, buffalo, fish, birds, ' etc. Elephants form a circle around their babies to protect them elephan] Rhinoceros and buffaloes have horns for defence: Some animals protect their soft bodies with a shell When faced with danger; - tortoise retracts itself into its shell.", "danger; - tortoise retracts itself into its shell. Another example is snail, which also has a shell for hiding its body: tortoise has a shell tortoise ` A porcupine has spines all over its body: Upon sensing hiding i its shell in danger; it uses its spines to attack the enemy Some animals are poisonous eg, some snakes have a poisonous bite. A cuttle fish has an ink sac on its body: When it senses danger; it releases ink from the ink sac, the water blue: The enemy cannot see anything for some time and cuttle fish escapes. making` Some animals pretend to be dead when they are in danger eg,, certain snakes A puffer fish can blow itself upto twice its normal size, so that it looks bigger and scares enemies. away its\n2.3 REPRODUCTION IN ANIMALS The process by which living beings produce their young ones is called reproduction. It is the process by which new living beings are produced which resemble their parents. Animals reproduce so that life on Earth can continue: Animals can be categorised based on how they reproduce.", "ls can be categorised based on how they reproduce. All animals grow into adults: The sequential stages of development that occur in life of an organism starting from egg O young one to a mature adult are termed as the life cycle of that animal Animals\nEgg-laying\nBirth-giving\nEg\" lion, dog,' cat; man, etc.\nEg; hen, snake, etc,\nEgg-laying Animals Hence, they are called as Birds, fish, insects, snakes, frogs, etc. are some of the animals that Jay eggs. egg-laying animals: Birds Most birds build nests on trees to Jay eggs and raise their babies After laying eggs, the mother Adult hen bird keeps the eggs warm by sitting on them. This Egg is called incubation. When baby bird develops Baby chick fully; it breaks open the egg shell and comes out, hatches out this process is called as hatching: Mother hen WatMS the eg8 The baby birds grow into adults. The parent birds feed and protect the young ones until they can look after themselves; Life cycle of a hen An egg of a hen is oval in shape and has a thin protective shell called the egg shell. An air space is present at the broad end of the egg: The air Egg shell - Yolk space grows larger as an egg ages. An egg has a Embryo white jelly-like substance inside called albumen Air space- which protects the embryo.", "lled albumen Air space- which protects the embryo. The yellow inner Albumen yolk; Yolk provides food part of the egg is called for the growing baby or embryo. The embryo chick, Albumen is rich in water Parts of an egg develops into a and proteins whereas Yolk is rich in fats.\nFish Fish Jay' thousands of eggs at a time in water: Fish eggs do not have have a jelly around them to protect them from water; shells: They Only few eggs grow into adult fish as many are also eaten away by predators. Baby fish is called fry: Reptiles Reptiles like lizards; snakes and turtles also lay eggs Reptile cgg shells are like thick leather; so that they do not break away easily Crocodile; tortoise, etc , lay eggs in shallow pits near river banks\nEggs\nAdult\nLile cydle ofa fish\nClass 4 Science 25\nFry\nFrogs in water: Each egg is surrounded by = Frogs lay cggs In large clusters called spawns 'jelly ! They {like = After few days, baby frogs hatch out: are called prolect IU from predators, subatan (o in water: It breathes through gills.", "s, subatan (o in water: It breathes through gills. It has adpoler, Iadpole looks like a little fish and lives only d tail and the tail grows shorter: The young frog begins  to and growing legs The Jegs = grow longer land: It now breathes look ! Nn loses its tail and can now live on through \" parents now; Adult frog lung: Is lot from young to adult stage, this process is called as ande When an organism changes a metamorpho  4 Adult L frog Spawn (cluster of eggs)\nTadpole loses its tail\nsingle egg\nTadploe grows legs\nTadpole Life cycle ofa frog\nTable: Differences between a tadpole and an adult frog Tadpole Adult frog It looks like a fish and lives in water: It is amphibious and it can live both on land and in (ji) It has a tail. It has no tail water , | (iii) It breathes through gills. It breathes through skin and lungs:\nInsects Depending on the number of stages, life cycle of insects is of two types, i.e  three-staged staged. Grasshopper and cockroach have three stages in their life cycle: A and four: female cockroach lays = many € in a case.", "nd four: female cockroach lays = many € in a case. A baby cockroach hatches out of the egg and is called a nymph: A nymph looks C88s| similar = adult; except it is smaller and does not have wings. As it grows bigger; it sheds its old skin to the] and grows _ one. This process of 'shedding of old skin and getting a new one is called moulting: After new many - moultings; nymph becomes an adult.\nEgg (in egg case)\nAdult\nNymph Life-cycle ofa cockroach\nNymph moults 13 times to become an adult cockroach.\n26 \nTable : Differences between nymph and adult cockroach Nymph Adult cockroach It is smaller in size. It is larger in size: ii) It has no wings. It has wings: Butterfly, moth and houselly have four stages in their life Butterflies Jay their eggs on leaves: cycle: Young ones (larvae) hatching eat leaves and grow out of the eggs are called caterpillars. Caterpillars fast The caterpillar makes a cocoon Or & cgge aroud itself At this stage, the young one is called pupa feeding: changes into that stops The caterpillar keeps changing inside the cocoon.", " The caterpillar keeps changing inside the cocoon. After the pupa beautiful butterfly, it comes out of the cocoon.\nAdult butterfly Eggs ~h) Caterpillar\nAdult housefly\nEggs 2\nLarva (maggot)\nLife cycle ofa butterfly\nLife cycle of a housefly\nBirth-giving Animals milk Such Some animals do not lay eggs They give birth to young ones that feed on their motherfs Mammals take care of their young animals are called mammals. Eg, Tiger; lion, bat, dog, cat, etc like feeding them, cleaning them, keeping them safe until they are independent: ones marsupial. Baby kangaroo Marsupials are mammals that carry their babies in their pouch: Kangaroo is a stays in its mother$ pouch, where it drinks its mothers milk when they hatch out: e.g, duck Some primitive mammals lay eggs and then suckle their young ones  billed platypuss echidna\nMother and her baby\nDog and pups Kangaroo and joey Tiger and cub Animals that give birth 2.4 FOOD CHAIN; FOOD WEB AND ENERGY FLOW and  A food chain consists of series of 'populations related by eating being eaten: It is always straight: A network of interconnected food Energy for food chains come from chains is called food web. the   Sun.", "ns come from chains is called food web. the   Sun. Therefore, Sun is the Flow of energy in a food chain or food web is always in one direction: ultimate source of energy:\nScience 27\nPupa\nPlonts Herbivore Carnivore 1c organisms that make their Producers are the Own Wu connon Mow In reverse direction: are the organisms that get food .", "verse direction: are the organisms that get food . are plants; Consumers common example of producers feed directly on producers their consumers 0 producers cither directly or indirectly; Primary  carnivores: Tertiary 6 0 consumers 68 , Secondary consumers feed on primary consumers 1 becondary consumers and so on, food chain affect other [ populations; For example, if 6 Changes E in one population ofa number = consumers is reduced,it will cause an increase in primary consumer population (in absence = of and a subsequent decrease in producer population (as higher number of primary 0f 1 morc producers ) consumers - 1 9\nQuaternary consumers\nHawk (Carnivore)\nPython\nTertiary Snake consumers (Carnivore) Secondary consumers Frog (Carnivore)\nWolf\nRat\nDragonfly\nFruit [ fly\nGrass Producers (Producer) Corn The Food arrow points to the eater Alowering  Chain Plant and shows the transfer of Lavenders Mangoes energy ) \nEagle\nThrush\nFrog\nButterfly _\nPrimary consumers Grasshopper (Herbivore)\nGrasshopper"], "metas": [{"grade": "4", "subject": "science", "chapter": "plants", "topics": ["food", "mountains", "the plant", "1.1 i.e", "them"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c1"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["food", "the plant", "the", "arts", "itself"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c2"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["stoma side veins", "food", "number", "the plant", "the main vein"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c3"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["the glucose", "oxygen", "the plant", "seeds", "the form"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c4"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["radish fenugreek", "spinach", "examples mango", "blue-black", "the leaf"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c5"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["any activity", "food", "oxygen", "the plant", "the main source"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c6"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["this process", "swamps", "low water conditions", "the cold weather", "winter"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c7"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["the snow", "mountains", "pine tree", "cone", "winter"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c8"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["the snow", "vapour", "seeds", "them", "babool"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c9"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["hot\nacacia tree date palm cactus certain plants", "mesquite tree", "sunken stomata", "them", "the surface"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c10"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["pneumatophores", "swamps", "sunken stomata", "soil", "them"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c11"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["water lily", "such plants", "the water surface", "them", "air"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c12"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["tiny leaves", "hydrilla\ntape grass", "food", "insects", "such plants"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c13"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["such plants", "food", "the plant", "fungi", "them"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c14"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["nuts", "insects", "(a) dodder vc", "medicines", "fungi"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c15"}, {"grade": "4", "subject": "science", "chapter": "plants", "topics": ["oxygen", "a plant (b) papyrus plant", " sunlight", "sundew", "bamboo dioxide"], "source_file": "plants.pdf", "chunk_id": "4_science_plants_plants_c16"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["insects", "worms", "chitin", "2.2 adaptations", "snails"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c1"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["two legs", "insects", "scales", "mackerel", "4 gills"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c2"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["their changes", "jay ' cold-blooded animals", "their   body temperature", "feathers", "ostrich\nkiwi\npenguin flightless"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c3"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["the earth", "s-(iv", "its body r fish", "the amphibian", "they"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c4"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["arimaak ` corglete \" adaptations", "food", "mountains", "them", "protection\nadaptations"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c5"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["its body", "very ilttle urlne", "dung", "the snow", "a flightless bird"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c6"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["insects", "food", "the furry hair", "mountains", "source"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c7"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["cat", "scales", "the surface", "himalayan snow mountains", "tiger"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c8"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["swimming", "arms", "a tail", "them", "frog salamander r eight arms"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c9"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["the air", "mountains", "feathers", "them", "the given animals"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c10"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["penguin s. a tail", "r-(ii", "all", "s-(iv", "which"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c11"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["food", "herbivores  animals", "substance", "longer time", "all"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c12"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["nuts", "insects", "food", "butterfly", "longer period"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c13"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["food", "them", "some animals", "the host", "crow\nscavengers"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c14"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["food", "many animals", "aestivation or summer arctic ground squirrel", "almost all types", "siberia"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c15"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["some snakes", "food", "most animals", "their chances", "mimicry"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c16"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["their babies", "them", "itself", "some animals", "grasshopper"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c17"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["its body", "some snakes", "reproduction", "itself", "some animals"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c18"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["cat", "insects", "incubation", "adults", "this process"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c19"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["shallow pits", "the embryo chick", "them", "spawns", "the egg"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c20"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["only d tail", "this process", "insects", "a case", "a tail"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c21"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["this process", "a case", "butterfly", "an adult", "the"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c22"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["cat", "a food chain", "their young animals", "milk", "their babies"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c23"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["ultimate source", "mow", "food", "chains", "a food chain or food web"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c24"}, {"grade": "4", "subject": "science", "chapter": "animals", "topics": ["tertiary 6 0 consumers", "common example", "food", "producer", "other [ populations"], "source_file": "Animals.pdf", "chunk_id": "4_science_animals_Animals_c25"}]}